Revit 2026 API

# ExportDWGSettingsSetDWGExportOptions Method

---

Sets the options stored in these settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDWGExportOptions(
	DWGExportOptions options
)
```
```vb
Public Sub SetDWGExportOptions (
	options As DWGExportOptions
)
```
```cpp
public:
void SetDWGExportOptions(
	DWGExportOptions^ options
)
```
```fsharp
member SetDWGExportOptions :
        options : DWGExportOptions -> unit
```

#### Parameters

options DWGExportOptions
     The options.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportDWGSettings Class

Autodesk.Revit.DB Namespace